//  <새창띄우기> 
                                //미리 두개창 디자인하여  놓고  
                                //    new 클래스이름( ).setVisible(true); /////////////////
                           //----------------------------------



//btnNewButton.addMouseListener(new MouseAdapter() {
//                        @Override
//                        public void mouseClicked(MouseEvent arg0) {
//                                //=====================================
//                                dispose(); //지금창 해제//프레임을 닫는 것
//                                setVisible(false);//지금창 안보이게(AA)
//                                new BB().setVisible(true);////////AA.java ,   BB.java 
//                 //객체.메소드() 
//                                //----------------------------------
//                                //  <새창띄우기> 
//                                //미리 두개창 디자인하여  놓고  
//                                //    new 클래스이름( ).setVisible(true); /////////////////
//                           //----------------------------------
//                        }
//                        //==================================================
//                });